Repository: Felix3qH4/Datz
Catalog: datz_flutter/assets/l10n/app_*.arb
Languages: de

source: edit
de: änneren

source: Change Class
de: Klass änneren

source: Back
de: Zréck

source: Edit Class
de: Klass änneren

source: Name
de: Numm

source: Subject Name
de: Numm vum Fach

source: coefficient
de: Koeffizient

source: Delete
de: Läschen

source: Use Semesters
de: Semesteren

source: Has Exams
de: Examen

source: Combi Subjects
de: Kombifächer

# reportAsMistake
source: Report as Mistake in Preset
de: Als Fehler an der App mellen

# reportAsMissing
source: Report as missing Class
de: Als Fehlend mellen

# reportAsMistakeDesciption
source: If you disagree with the preset class, please tick this box so that your changes will be reported to the developer.
de: Falls dess Box getickt ass, gëtt deng Ännerung un den Entwéckler gescheckt. W.e.g. nëmmen unticken wann et wierklech e Fehler ass.

source: Subject
de: Fach

source: Combi
de: Kombi

source: Class
de: Klass

source: Save
de: Späicheren

source: Settings
de: Astellungen

source: Language
de: Sprooch

source: Credits
de: Info

source: Select Class
de: Klass auswielen

source: Your Classes
de: Deng Klassen

# presetClass
source: Preset Classes
de: All Klassen

source: Nothing Found?
de: Näischt fonnt?

source: Create your Own
de: Eegen Klass maachen

source: Delete Class?
de: Klass läschen?

# allDataInClassLost
source: Data in this class will be lost forever.
de: All Daten vun dëser Klass wäerten verluer goen.

source: Cancel
de: Ofbriechen

source: Tests
de: Tester

# fixedContribTests
source: Fixed Contribution Tests
de: Fixen Bäitrag Tester

source: Add Test
de: Neien Test

source: Edit Test
de: Test Änneren

source: Name cannot be Empty.
de: Numm kann net eidel sinn.

# gradeMustBeNumber
source: Grade must be a Number.
de: Notte muss eng Nummer sinn

# maxGradeMustBeNumber
source: Max Grade must be a Number.
de: Maximal Notte muss eng Nummer sinn

source: Grade
de: Notte

source: Max Grade
de: Max Notte

# fixedContribExplanation
source: This option should be used for orals or TPs that contribute a fixed portion to the average, e.g. 1/2
de: Dës Optioun soll fir Oralen oder TPen benotzt ginn, déi e fixen Deel zum Duerchschnëtt bäidroen, z.B. 1/2

source: More Options
de: Méi Optiounen

# fixedContrib
source: Fixed Contribution
de: Fixen Bäitrag

source: Add
de: Späicheren

# reviewIncentive
source: If you enjoy Datz, please leave a Review. It would mean a lot to me.
de: Wann dir Datz gefällt, looss w.e.g. eng Bewäertung. Et géif mir vill bedeiten.

source: Review
de: Bewäerten

# madeWithLove
source: Made with ❤️
de: Gemaach mat ❤️

# creditsBigTextPreGH
source: Datz! is a project I started a few years ago when I needed a grade calculator myself. It was never intended to reach the audience that it did, but I am very grateful that there are so many students who can benefit from the app. I still work on the project in my spare time and when communicating with me, please keep in mind that I am just another person and that I am allowed to make mistakes. That being said, if you find a bug or if you have an improvement idea, feel free to open an issue on
de: Datz! ass e Projet deen ech virun e puer Joer ugefaang hunn wéi ech selwer e Nottenrechner gebraucht hunn. Et war ni geduecht fir d'Publikum z'erreechen, dat et haut huet, awer ech si dankbar datt et sou vill Studenten ginn déi vun der App profitéiere kënnen. Ech schaffen nach ëmmer a menger Fräizäit um Projet a denk w.e.g. drun datt ech just eng aner Persoun sinn an datt ech däerf Feeler maachen. Dat gesot, wanns de e Feeler fënns oder wanns du eng Verbesserung hues, kanns du gären eng Issue opmaachen op

# creditsBigTextPostGH
source: . I will try my best to solve your problems. All Data and calculated Averages is without Gurantee.
de: . Ech probéieren mäi Bescht fir deng Problemer ze léisen. All Donnéeën a berechent Duerchschnëtter sinn ouni Garantie.
